[TIMER] Process Time: 08:37:59
[INFO] GPU not detected.
[INFO] Done importing packages.

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 12)          1812      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 12)          0         
_________________________________________________________________
flatten (Flatten)            (None, 192)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               23160     
_________________________________________________________________
dense_1 (Dense)              (None, 60)                7260      
_________________________________________________________________
dense_2 (Dense)              (None, 40)                2440      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                410       
=================================================================
Total params: 35,238
Trainable params: 35,238
Non-trainable params: 0
_________________________________________________________________
2021-02-23 08:38:08.782970: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/20
15000/15000 [==============================] - 228s 15ms/step - loss: 0.0687 - accuracy: 0.5105 - val_loss: 0.0384 - val_accuracy: 0.7570
Epoch 2/20
15000/15000 [==============================] - 152s 10ms/step - loss: 0.0365 - accuracy: 0.7694 - val_loss: 0.0324 - val_accuracy: 0.7974
Epoch 3/20
15000/15000 [==============================] - 115s 8ms/step - loss: 0.0313 - accuracy: 0.8074 - val_loss: 0.0294 - val_accuracy: 0.8180
Epoch 4/20
15000/15000 [==============================] - 83s 6ms/step - loss: 0.0283 - accuracy: 0.8306 - val_loss: 0.0277 - val_accuracy: 0.8301
Epoch 5/20
15000/15000 [==============================] - 105s 7ms/step - loss: 0.0265 - accuracy: 0.8402 - val_loss: 0.0264 - val_accuracy: 0.8397
Epoch 6/20
15000/15000 [==============================] - 70s 5ms/step - loss: 0.0248 - accuracy: 0.8507 - val_loss: 0.0248 - val_accuracy: 0.8466
Epoch 7/20
15000/15000 [==============================] - 67s 4ms/step - loss: 0.0236 - accuracy: 0.8559 - val_loss: 0.0244 - val_accuracy: 0.8499
Epoch 8/20
15000/15000 [==============================] - 69s 5ms/step - loss: 0.0226 - accuracy: 0.8629 - val_loss: 0.0230 - val_accuracy: 0.8560
Epoch 9/20
15000/15000 [==============================] - 69s 5ms/step - loss: 0.0218 - accuracy: 0.8670 - val_loss: 0.0224 - val_accuracy: 0.8589
Epoch 10/20
15000/15000 [==============================] - 98s 7ms/step - loss: 0.0215 - accuracy: 0.8660 - val_loss: 0.0219 - val_accuracy: 0.8639
Epoch 11/20
15000/15000 [==============================] - 96s 6ms/step - loss: 0.0205 - accuracy: 0.8715 - val_loss: 0.0214 - val_accuracy: 0.8646
Epoch 12/20
15000/15000 [==============================] - 84s 6ms/step - loss: 0.0201 - accuracy: 0.8750 - val_loss: 0.0212 - val_accuracy: 0.8660
Epoch 13/20
15000/15000 [==============================] - 91s 6ms/step - loss: 0.0198 - accuracy: 0.8770 - val_loss: 0.0214 - val_accuracy: 0.8668
Epoch 14/20
15000/15000 [==============================] - 83s 6ms/step - loss: 0.0190 - accuracy: 0.8811 - val_loss: 0.0206 - val_accuracy: 0.8698
Epoch 15/20
15000/15000 [==============================] - 97s 6ms/step - loss: 0.0188 - accuracy: 0.8821 - val_loss: 0.0206 - val_accuracy: 0.8652
Epoch 16/20
15000/15000 [==============================] - 78s 5ms/step - loss: 0.0185 - accuracy: 0.8832 - val_loss: 0.0201 - val_accuracy: 0.8718
Epoch 17/20
15000/15000 [==============================] - 89s 6ms/step - loss: 0.0183 - accuracy: 0.8822 - val_loss: 0.0192 - val_accuracy: 0.8768
Epoch 18/20
15000/15000 [==============================] - 78s 5ms/step - loss: 0.0177 - accuracy: 0.8880 - val_loss: 0.0194 - val_accuracy: 0.8758
Epoch 19/20
15000/15000 [==============================] - 88s 6ms/step - loss: 0.0177 - accuracy: 0.8885 - val_loss: 0.0189 - val_accuracy: 0.8787
Epoch 20/20
15000/15000 [==============================] - 89s 6ms/step - loss: 0.0173 - accuracy: 0.8906 - val_loss: 0.0189 - val_accuracy: 0.8756


----------------------------------------------------------------–––––––––––––––––––––––––––––––––––


Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 12)          1812      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 12)          0         
_________________________________________________________________
flatten (Flatten)            (None, 192)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               23160     
_________________________________________________________________
dense_1 (Dense)              (None, 60)                7260      
_________________________________________________________________
dense_2 (Dense)              (None, 40)                2440      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                410       
=================================================================
Total params: 35,238
Trainable params: 35,238
Non-trainable params: 0
_________________________________________________________________
2021-02-23 14:39:33.214482: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/20
15000/15000 [==============================] - 88s 6ms/step - loss: 0.0424 - accuracy: 0.6991 - val_loss: 0.0225 - val_accuracy: 0.8568
Epoch 2/20
15000/15000 [==============================] - 85s 6ms/step - loss: 0.0212 - accuracy: 0.8640 - val_loss: 0.0195 - val_accuracy: 0.8721
Epoch 3/20
15000/15000 [==============================] - 122s 8ms/step - loss: 0.0186 - accuracy: 0.8792 - val_loss: 0.0197 - val_accuracy: 0.8692
Epoch 4/20
15000/15000 [==============================] - 102s 7ms/step - loss: 0.0177 - accuracy: 0.8826 - val_loss: 0.0185 - val_accuracy: 0.8722
Epoch 5/20
15000/15000 [==============================] - 120s 8ms/step - loss: 0.0168 - accuracy: 0.8906 - val_loss: 0.0189 - val_accuracy: 0.8738
Epoch 6/20
15000/15000 [==============================] - 107s 7ms/step - loss: 0.0164 - accuracy: 0.8917 - val_loss: 0.0178 - val_accuracy: 0.8822
Epoch 7/20
15000/15000 [==============================] - 107s 7ms/step - loss: 0.0157 - accuracy: 0.8970 - val_loss: 0.0176 - val_accuracy: 0.8831
Epoch 8/20
15000/15000 [==============================] - 93s 6ms/step - loss: 0.0154 - accuracy: 0.8997 - val_loss: 0.0172 - val_accuracy: 0.8841
Epoch 9/20
15000/15000 [==============================] - 89s 6ms/step - loss: 0.0149 - accuracy: 0.9041 - val_loss: 0.0176 - val_accuracy: 0.8856
Epoch 10/20
15000/15000 [==============================] - 103s 7ms/step - loss: 0.0148 - accuracy: 0.9033 - val_loss: 0.0169 - val_accuracy: 0.8837
Epoch 11/20
15000/15000 [==============================] - 153s 10ms/step - loss: 0.0139 - accuracy: 0.9105 - val_loss: 0.0172 - val_accuracy: 0.8867
Epoch 12/20
15000/15000 [==============================] - 114s 8ms/step - loss: 0.0140 - accuracy: 0.9091 - val_loss: 0.0175 - val_accuracy: 0.8856
Epoch 13/20
15000/15000 [==============================] - 109s 7ms/step - loss: 0.0136 - accuracy: 0.9127 - val_loss: 0.0176 - val_accuracy: 0.8831
Epoch 14/20
15000/15000 [==============================] - 146s 10ms/step - loss: 0.0134 - accuracy: 0.9130 - val_loss: 0.0179 - val_accuracy: 0.8807
Epoch 15/20
15000/15000 [==============================] - 140s 9ms/step - loss: 0.0132 - accuracy: 0.9159 - val_loss: 0.0179 - val_accuracy: 0.8808
Epoch 16/20
15000/15000 [==============================] - 82s 5ms/step - loss: 0.0131 - accuracy: 0.9162 - val_loss: 0.0174 - val_accuracy: 0.8876
Epoch 17/20
15000/15000 [==============================] - 92s 6ms/step - loss: 0.0130 - accuracy: 0.9171 - val_loss: 0.0167 - val_accuracy: 0.8876
Epoch 18/20
15000/15000 [==============================] - 94s 6ms/step - loss: 0.0128 - accuracy: 0.9193 - val_loss: 0.0169 - val_accuracy: 0.8896
Epoch 19/20
15000/15000 [==============================] - 83s 6ms/step - loss: 0.0126 - accuracy: 0.9195 - val_loss: 0.0171 - val_accuracy: 0.8891
Epoch 20/20
15000/15000 [==============================] - 82s 5ms/step - loss: 0.0123 - accuracy: 0.9224 - val_loss: 0.0173 - val_accuracy: 0.8855


-------------------------------------------––––––––––––––––––––––––––––––––––––––––––––––––––––


Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 12)          1812      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 12)          0         
_________________________________________________________________
flatten (Flatten)            (None, 192)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               23160     
_________________________________________________________________
dense_1 (Dense)              (None, 60)                7260      
_________________________________________________________________
dense_2 (Dense)              (None, 40)                2440      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                410       
=================================================================
Total params: 35,238
Trainable params: 35,238
Non-trainable params: 0
_________________________________________________________________
2021-02-23 15:36:56.727977: I tensorflow/compiler/mlir/mlir_graph_optimization_pass.cc:116] None of the MLIR optimization passes are enabled (registered 2)
Epoch 1/20
15000/15000 [==============================] - 69s 5ms/step - loss: 0.0412 - accuracy: 0.7184 - val_loss: 0.0330 - val_accuracy: 0.7790
Epoch 2/20
15000/15000 [==============================] - 68s 5ms/step - loss: 0.0261 - accuracy: 0.8401 - val_loss: 0.0256 - val_accuracy: 0.8325
Epoch 3/20
15000/15000 [==============================] - 67s 4ms/step - loss: 0.0243 - accuracy: 0.8497 - val_loss: 0.0241 - val_accuracy: 0.8465
Epoch 4/20
15000/15000 [==============================] - 67s 4ms/step - loss: 0.0244 - accuracy: 0.8477 - val_loss: 0.0265 - val_accuracy: 0.8304
Epoch 5/20
15000/15000 [==============================] - 67s 4ms/step - loss: 0.0252 - accuracy: 0.8483 - val_loss: 0.0278 - val_accuracy: 0.8337
Epoch 6/20
15000/15000 [==============================] - 66s 4ms/step - loss: 0.0245 - accuracy: 0.8516 - val_loss: 0.0234 - val_accuracy: 0.8491
Epoch 7/20
15000/15000 [==============================] - 66s 4ms/step - loss: 0.0238 - accuracy: 0.8565 - val_loss: 0.0234 - val_accuracy: 0.8468
Epoch 8/20
15000/15000 [==============================] - 70s 5ms/step - loss: 0.0244 - accuracy: 0.8538 - val_loss: 0.0245 - val_accuracy: 0.8422
Epoch 9/20
15000/15000 [==============================] - 75s 5ms/step - loss: 0.0252 - accuracy: 0.8477 - val_loss: 0.0289 - val_accuracy: 0.8283
Epoch 10/20
15000/15000 [==============================] - 62s 4ms/step - loss: 0.0293 - accuracy: 0.8400 - val_loss: 0.0278 - val_accuracy: 0.8388
Epoch 11/20
15000/15000 [==============================] - 62s 4ms/step - loss: 0.0273 - accuracy: 0.8423 - val_loss: 0.0583 - val_accuracy: 0.5706
Epoch 12/20
15000/15000 [==============================] - 63s 4ms/step - loss: 0.0494 - accuracy: 0.6499 - val_loss: 0.0622 - val_accuracy: 0.5661
Epoch 13/20
15000/15000 [==============================] - 65s 4ms/step - loss: 0.0625 - accuracy: 0.5129 - val_loss: 0.0930 - val_accuracy: 0.1000
Epoch 14/20
15000/15000 [==============================] - 68s 5ms/step - loss: 0.0916 - accuracy: 0.1083 - val_loss: 0.0914 - val_accuracy: 0.1775
Epoch 15/20
15000/15000 [==============================] - 74s 5ms/step - loss: 0.0901 - accuracy: 0.1353 - val_loss: 0.0911 - val_accuracy: 0.1000
Epoch 16/20
15000/15000 [==============================] - 79s 5ms/step - loss: 0.0924 - accuracy: 0.0976 - val_loss: 0.0910 - val_accuracy: 0.1000
Epoch 17/20
15000/15000 [==============================] - 79s 5ms/step - loss: 0.0922 - accuracy: 0.1002 - val_loss: 0.0908 - val_accuracy: 0.1000
Epoch 18/20
15000/15000 [==============================] - 80s 5ms/step - loss: 0.0922 - accuracy: 0.1000 - val_loss: 0.0957 - val_accuracy: 0.1000
Epoch 19/20
15000/15000 [==============================] - 79s 5ms/step - loss: 0.0924 - accuracy: 0.0973 - val_loss: 0.0919 - val_accuracy: 0.1000
Epoch 20/20
15000/15000 [==============================] - 82s 5ms/step - loss: 0.0921 - accuracy: 0.1034 - val_loss: 0.0910 - val_accuracy: 0.1000
